KB6003/Tutorial2/start/ahmed/system/surfaceFeatureExtractDict
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  dev
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      surfaceFeatureExtractDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

ab1.stl
{
    // How to obtain raw features (extractFromFile || extractFromSurface)
    extractionMethod    extractFromSurface;

    extractFromSurfaceCoeffs
    {
	// Identify a feature when angle between faces < includedAngle
	// - 0  : selects no edges
	// - 180: selects all edges
	includedAngle       150;

    }

    // Write options
    // Write features to obj format for postprocessing
	writeObj                yes;
}

ab2.stl
{
    // How to obtain raw features (extractFromFile || extractFromSurface)
    extractionMethod    extractFromSurface;

    extractFromSurfaceCoeffs
    {
	// Identify a feature when angle between faces < includedAngle
	// - 0  : selects no edges
	// - 180: selects all edges
	includedAngle       150;

    }

    // Write options
    // Write features to obj format for postprocessing
	writeObj                yes;
}

support.stl
{
    // How to obtain raw features (extractFromFile || extractFromSurface)
    extractionMethod    extractFromSurface;

    extractFromSurfaceCoeffs
    {
	// Identify a feature when angle between faces < includedAngle
	// - 0  : selects no edges
	// - 180: selects all edges
	includedAngle       150;

    }

    // Write options
    // Write features to obj format for postprocessing
	writeObj                yes;
}
// ************************************************************************* //
